KanatERPSukhova.КанатАдаптация/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bf75bcc5-82ee-4bd0-89e1-420b42c99454">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВИПКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ИспользоватьГрупповыеУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_КодСбыта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Отрасль</name>
    <type>
      <types>CatalogRef.КАНАТ_Отрасль</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ФормаОрганизации</name>
    <type>
      <types>CatalogRef.КАНАТ_ФормаОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ГруппировкаДляОтчета</name>
    <type>
      <types>CatalogRef.КАНАТ_ГруппировкаДляОтчета</types>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="0daacbf9-aa02-4485-a535-d2d28b00523c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4259c461-12b1-4f3e-8283-5927c75afdb6">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="2629d638-1c9b-4112-b68e-0560bb2d997b">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="21ef8fb5-99ad-409e-9d21-398379db456f">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c62fe487-31b1-4ebb-b1a8-ad1821952696">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9a6552a-9493-4353-953b-2f7c777b2f61">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/Партнеры/ObjectModule.bsl
&После("ПередЗаписью")
Процедура КАНАТ_ПередЗаписью(Отказ)
	//БИТ_Гурьев__28.03.24++
	АдресУказан = Ложь;
	
	Для Каждого Строка Из ЭтотОбъект.КонтактнаяИнформация Цикл
		
		Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера Тогда
			
			АдресУказан = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не АдресУказан Тогда
			
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтрагентыКонтактнаяИнформация.Представление КАК Представление,
			|	КонтрагентыКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
			|	КонтрагентыКонтактнаяИнформация.Страна КАК Страна,
			|	КонтрагентыКонтактнаяИнформация.Регион КАК Регион,
			|	КонтрагентыКонтактнаяИнформация.Город КАК Город,
			|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП,
			|	КонтрагентыКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
			|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
			|	КонтрагентыКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
			|	КонтрагентыКонтактнаяИнформация.ВидДляСписка КАК ВидДляСписка,
			|	КонтрагентыКонтактнаяИнформация.ДействуетС КАК ДействуетС,
			|	КонтрагентыКонтактнаяИнформация.Значение КАК Значение
			|ИЗ
			|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = Контрагенты.Ссылка
			|ГДЕ
			|	Контрагенты.Партнер = &Партнер
			|	И КонтрагентыКонтактнаяИнформация.Вид = &Вид";
		
		Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		Запрос.УстановитьПараметр("Партнер", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НовыйАдрес = КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйАдрес, ВыборкаДетальныеЗаписи);
			НовыйАдрес.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			НовыйАдрес.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
		КонецЕсли;
	
		
	КонецЕсли;
	//БИТ_Гурьев__28.03.24--
КонецПроцедуры
